aerospike_cassandra_ycsb/aerospike_data/aerospike_workloadc
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.AerospikeClient -s -P /opt/ycsb/workloads/workloadc -p workload=com.yahoo.ycsb.workloads.CoreWorkload -p updateretrycount=1000 -p ns=test -p recordcount=50000000 -p exportmeasurementsinterval=30000 -p fieldcount=10 -p timeseries.granularity=100 -p host=f1 -p threadcount=32 -p insertretrycount=10 -p readretrycount=1000 -p ignoreinserterrors=true -p reconnectionthroughput=10 -p operationcount=60000000 -p fieldnameprefix=f -p maxexecutiontime=60 -p set=YCSB -p measurementtype=timeseries -p reconnectiontime=1000 -p port=3000 -p fieldlength=10 -t
Loading workload...
Starting test.
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup execution time: 0
Warmup operations: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup execution time: 0
Warmup execution time: 0
Warmup operations: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup execution time: 0
Warmup operations: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup execution time: 0
Warmup operations: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Warmup execution time: 0
Warmup operations: 0
Maximum execution time specified as: 60 secs
 0 sec: 0 operations; 
 0 sec: 0 operations; 
 2 sec: 441445 operations; 217139.7 current ops/sec; [READ AverageLatency(us)=127.58] 
 2 sec: 441445 operations; 217139.7 current ops/sec; [READ AverageLatency(us)=106.99] 
 4 sec: 1041197 operations; 299576.42 current ops/sec; [READ AverageLatency(us)=103.35] 
 4 sec: 1041197 operations; 299576.42 current ops/sec; [READ AverageLatency(us)=107.59] 
 6 sec: 1641468 operations; 300135.5 current ops/sec; [READ AverageLatency(us)=103.22] 
 6 sec: 1641468 operations; 300135.5 current ops/sec; [READ AverageLatency(us)=103.68] 
 8 sec: 2241261 operations; 299896.5 current ops/sec; [READ AverageLatency(us)=103.2] 
 8 sec: 2241261 operations; 299896.5 current ops/sec; [READ AverageLatency(us)=104.03] 
 10 sec: 2842032 operations; 300235.38 current ops/sec; [READ AverageLatency(us)=103.09] 
 10 sec: 2842032 operations; 300235.38 current ops/sec; [READ AverageLatency(us)=99.1] 
 12 sec: 3442886 operations; 300427 current ops/sec; [READ AverageLatency(us)=103.14] 
 12 sec: 3442886 operations; 300427 current ops/sec; [READ AverageLatency(us)=100.47] 
 14 sec: 4040224 operations; 298519.74 current ops/sec; [READ AverageLatency(us)=103.63] 
 14 sec: 4040224 operations; 298519.74 current ops/sec; [READ AverageLatency(us)=114.53] 
 16 sec: 4635293 operations; 297534.5 current ops/sec; [READ AverageLatency(us)=104.06] 
 16 sec: 4635293 operations; 297534.5 current ops/sec; [READ AverageLatency(us)=110.5] 
 18 sec: 5231327 operations; 298017 current ops/sec; [READ AverageLatency(us)=103.91] 
 18 sec: 5231327 operations; 298017 current ops/sec; [READ AverageLatency(us)=104.09] 
 20 sec: 5826730 operations; 297552.72 current ops/sec; [READ AverageLatency(us)=103.99] 
 20 sec: 5826730 operations; 297552.72 current ops/sec; [READ AverageLatency(us)=101.37] 
 22 sec: 6420237 operations; 296605.2 current ops/sec; [READ AverageLatency(us)=104.31] 
 22 sec: 6420237 operations; 296605.2 current ops/sec; [READ AverageLatency(us)=99.36] 
 24 sec: 7016323 operations; 298043 current ops/sec; [READ AverageLatency(us)=103.88] 
 24 sec: 7016323 operations; 298043 current ops/sec; [READ AverageLatency(us)=102.19] 
 26 sec: 7613033 operations; 298205.9 current ops/sec; [READ AverageLatency(us)=103.75] 
 26 sec: 7613033 operations; 298205.9 current ops/sec; [READ AverageLatency(us)=109.1] 
 28 sec: 8207701 operations; 297334 current ops/sec; [READ AverageLatency(us)=104.18] 
 28 sec: 8207701 operations; 297334 current ops/sec; [READ AverageLatency(us)=95.79] 
[READ], 0, 472.4515036001694, 47220.0
[READ], 100, 277.7831447635625, 68940.0
[READ], 200, 178.62497293395887, 138550.0
[READ], 300, 170.52692113245703, 158240.0
[READ], 400, 167.98082052584783, 157460.0
[READ], 500, 168.87553838358247, 157880.0
[READ], 600, 171.49644481455385, 156110.0
[READ], 700, 163.9524765729585, 164340.0
[READ], 800, 133.09638762708198, 231150.0
[READ], 900, 130.96815530673933, 234890.0
[READ], 1000, 109.79630631605527, 277230.0
[READ], 1100, 103.8653429113581, 295120.0
[READ], 1200, 102.45935162094763, 300750.0
[READ], 1300, 102.45990228987337, 300890.0
[READ], 1400, 102.2320060750132, 302880.0
[READ], 1500, 103.04782840394351, 300240.0
[READ], 1600, 104.05972960247529, 297340.0
[READ], 1700, 103.38629053872957, 298480.0
[READ], 1800, 106.33350501304766, 291240.0
[READ], 1900, 105.43936217739441, 290990.0
[READ], 2000, 109.46346832523848, 286190.0
[READ], 2100, 103.34874566319722, 299760.0
[READ], 2200, 101.33881998756503, 305590.0
[READ], 2300, 102.24916215947175, 301370.0
[READ], 2400, 103.32673894912428, 299750.0
[READ], 2500, 103.55337661468442, 298820.0
[READ], 2600, 104.24609006336794, 296680.0
[READ], 2700, 103.68772810982756, 298650.0
[READ], 2800, 103.51352974542057, 299710.0
[READ], 2900, 105.1249872842562, 294910.0
[READ], 3000, 102.68948136357606, 301560.0
[READ], 3100, 102.91222830595653, 301350.0
[READ], 3200, 101.14935383608703, 305650.0
[READ], 3300, 101.67025018903902, 304170.0
[READ], 3400, 101.916238978813, 303960.0
[READ], 3500, 102.4393904333741, 302510.0
[READ], 3600, 102.89661803713528, 301600.0
[READ], 3700, 103.18950456758019, 299940.0
[READ], 3800, 103.38422807602534, 299900.0
[READ], 3900, 106.87216609380967, 288030.0
[READ], 4000, 106.90740037950664, 289850.0
[READ], 4100, 102.79096007699201, 301330.0
[READ], 4200, 101.1054125477146, 306510.0
[READ], 4300, 101.56813417190776, 305280.0
[READ], 4400, 102.30822914599457, 302340.0
[READ], 4500, 102.7300235309714, 301730.0
[READ], 4600, 103.57192559882243, 298920.0
[READ], 4700, 103.18351010606364, 299820.0
[READ], 4800, 103.38473353813276, 299480.0
[READ], 4900, 104.06408965841219, 298020.0
[READ], 5000, 105.80190352732482, 293140.0
[READ], 5100, 104.2565636870945, 297470.0
[READ], 5200, 100.97260586319219, 307000.0
[READ], 5300, 101.31483727180361, 305110.0
[READ], 5400, 101.84458682437983, 304350.0
[READ], 5500, 102.31777028813111, 302640.0
[READ], 5600, 103.02616530354412, 300780.0
[READ], 5700, 103.22692934873041, 300490.0
[READ], 5800, 103.73730713879313, 298790.0
[READ], 5900, 105.4519802996101, 292380.0
[READ], 6000, 103.26441073512252, 299950.0
[READ], 6100, 106.7838788673128, 289930.0
[READ], 6200, 101.41891714735186, 305120.0
[READ], 6300, 101.8700782225728, 304260.0
[READ], 6400, 102.58654833261582, 301970.0
[READ], 6500, 103.0885070459984, 300880.0
[READ], 6600, 103.2185282654319, 300190.0
[READ], 6700, 103.60963388562266, 299360.0
[READ], 6800, 103.30137580979095, 299460.0
[READ], 6900, 103.13478144454113, 298780.0
[READ], 7000, 102.6094684385382, 301000.0
[READ], 7100, 103.32559303373036, 299730.0
[READ], 7200, 101.7084550976851, 304550.0
[READ], 7300, 101.68753903296847, 304230.0
[READ], 7400, 104.04600752789354, 297560.0
[READ], 7500, 102.94030496737248, 300360.0
[READ], 7600, 103.51699223976452, 298960.0
[READ], 7700, 103.35447860962567, 299200.0
[READ], 7800, 103.48870519728256, 298810.0
[READ], 7900, 104.52540364891853, 295430.0
[READ], 8000, 104.34245327575736, 296420.0
[READ], 8100, 104.5725208918361, 295570.0
[READ], 8200, 101.2064887117326, 306070.0
[READ], 8300, 101.767087276551, 304320.0
[READ], 8400, 102.11049541526486, 303180.0
[READ], 8500, 103.0167675826735, 300580.0
[READ], 8600, 103.56112967914439, 299200.0
[READ], 8700, 103.51877235799539, 299110.0
[READ], 8800, 103.34907391957283, 299650.0
[READ], 8900, 103.21022803040405, 299960.0
[READ], 9000, 102.47543424317618, 302250.0
[READ], 9100, 104.77046852815901, 295820.0
[READ], 9200, 101.85681490226945, 304920.0
[READ], 9300, 101.85033409038545, 303810.0
[READ], 9400, 102.49200422916805, 302660.0
[READ], 9500, 102.94934689400738, 300870.0
[READ], 9600, 103.4628714524207, 299500.0
[READ], 9700, 103.3328313253012, 298800.0
[READ], 9800, 103.45916697284478, 299390.0
[READ], 9900, 103.69261965410912, 298360.0
[READ], 10000, 105.30755914598961, 294610.0
[READ], 10100, 103.32230081409315, 299720.0
[READ], 10200, 101.75189773586146, 304310.0
[READ], 10300, 101.65512946574893, 305100.0
[READ], 10400, 102.4574819810884, 302460.0
[READ], 10500, 103.04580711741403, 300390.0
[READ], 10600, 103.60225146980224, 299360.0
[READ], 10700, 103.58721027459113, 298990.0
[READ], 10800, 103.63665271966528, 298750.0
[READ], 10900, 103.27491340261125, 300240.0
[READ], 11000, 103.99922816201887, 297990.0
[READ], 11100, 103.04980026631158, 300400.0
[READ], 11200, 102.06163120100139, 303580.0
[READ], 11300, 101.62702010248324, 304440.0
[READ], 11400, 102.43501834892717, 302470.0
[READ], 11500, 103.04540921481285, 300820.0
[READ], 11600, 103.30513564921414, 299670.0
[READ], 11700, 103.29254308476949, 299990.0
[READ], 11800, 103.6901427326945, 298460.0
[READ], 11900, 104.95003051054309, 294980.0
[READ], 12000, 103.87985640475073, 298060.0
[READ], 12100, 102.96398698884758, 301280.0
[READ], 12200, 103.27769058670317, 299470.0
[READ], 12300, 101.86282312701441, 304060.0
[READ], 12400, 102.39139500248221, 302150.0
[READ], 12500, 103.22571056410942, 299410.0
[READ], 12600, 104.28464772154027, 297350.0
[READ], 12700, 105.27021515244213, 294210.0
[READ], 12800, 104.59566567647853, 296240.0
[READ], 12900, 104.10458221024258, 296800.0
[READ], 13000, 103.5070880391434, 298390.0
[READ], 13100, 103.7063061251843, 298440.0
[READ], 13200, 102.7416345770814, 301240.0
[READ], 13300, 101.71065506484977, 304550.0
[READ], 13400, 102.85166733094194, 301080.0
[READ], 13500, 103.56460692983045, 298420.0
[READ], 13600, 106.17663798128021, 291670.0
[READ], 13700, 104.08975481611209, 296920.0
[READ], 13800, 104.01633876836006, 296840.0
[READ], 13900, 104.98462530545751, 294640.0
[READ], 14000, 105.65100167229788, 293010.0
[READ], 14100, 104.17960364725279, 297210.0
[READ], 14200, 102.4629010363209, 302030.0
[READ], 14300, 102.09734133790738, 303160.0
[READ], 14400, 103.81449586167611, 298430.0
[READ], 14500, 103.80526103878674, 298040.0
[READ], 14600, 104.35776443604965, 296480.0
[READ], 14700, 104.29089743157041, 296290.0
[READ], 14800, 105.61948472956833, 293050.0
[READ], 14900, 104.2905318209604, 294460.0
[READ], 15000, 107.68370584988962, 289920.0
[READ], 15100, 103.69007669379417, 298590.0
[READ], 15200, 104.48206081081081, 296000.0
[READ], 15300, 101.85687487658791, 303860.0
[READ], 15400, 102.80655433196232, 301480.0
[READ], 15500, 103.607286364854, 298640.0
[READ], 15600, 104.56026047641541, 296380.0
[READ], 15700, 103.75132221999063, 298740.0
[READ], 15800, 103.94595681909615, 298280.0
[READ], 15900, 104.39497755425793, 296270.0
[READ], 16000, 109.69539092322918, 282920.0
[READ], 16100, 104.16831583198707, 297120.0
[READ], 16200, 102.79220649458784, 300250.0
[READ], 16300, 101.48271681792863, 305210.0
[READ], 16400, 102.41780527343104, 302270.0
[READ], 16500, 103.97476224081728, 297570.0
[READ], 16600, 104.01242152616913, 297870.0
[READ], 16700, 105.74060419866872, 292950.0
[READ], 16800, 103.81518639063182, 298030.0
[READ], 16900, 104.11999059424234, 297690.0
[READ], 17000, 104.21544989224138, 296960.0
[READ], 17100, 103.89353714132476, 298320.0
[READ], 17200, 102.46259764332054, 302120.0
[READ], 17300, 101.5608436106009, 304880.0
[READ], 17400, 102.99860079288403, 300170.0
[READ], 17500, 104.51350256548744, 296240.0
[READ], 17600, 103.96180439014567, 297940.0
[READ], 17700, 104.66110679677213, 296170.0
[READ], 17800, 103.98702259279182, 297440.0
[READ], 17900, 105.51030137919291, 293650.0
[READ], 18000, 104.76993158572105, 295260.0
[READ], 18100, 103.45739054759673, 298760.0
[READ], 18200, 103.85969208063597, 298130.0
[READ], 18300, 101.71550446325637, 303590.0
[READ], 18400, 102.5491417588972, 301780.0
[READ], 18500, 103.98667115449344, 297100.0
[READ], 18600, 104.27801025917927, 296320.0
[READ], 18700, 105.1472586452884, 294380.0
[READ], 18800, 106.81932570325428, 290080.0
[READ], 18900, 104.73704154824739, 295560.0
[READ], 19000, 103.93641404805915, 297550.0
[READ], 19100, 104.45111844764857, 296840.0
[READ], 19200, 103.20629358961524, 299670.0
[READ], 19300, 101.95542469899335, 303980.0
[READ], 19400, 102.49302571560786, 302540.0
[READ], 19500, 103.1376229371562, 299950.0
[READ], 19600, 104.81868113239533, 294950.0
[READ], 19700, 104.64375696578743, 296090.0
[READ], 19800, 104.33842684527616, 297110.0
[READ], 19900, 104.48407707910751, 295800.0
[READ], 20000, 105.31476569407604, 294060.0
[READ], 20100, 104.27209763641865, 297430.0
[READ], 20200, 105.29168366653067, 294120.0
[READ], 20300, 102.36751403103334, 302900.0
[READ], 20400, 102.23940495867768, 302500.0
[READ], 20500, 103.80284054662056, 297830.0
[READ], 20600, 104.78138857858569, 295410.0
[READ], 20700, 104.43394123606889, 296100.0
[READ], 20800, 104.49611617696723, 296100.0
[READ], 20900, 105.98421484214842, 292680.0
[READ], 21000, 104.57232130793136, 296040.0
[READ], 21100, 105.79277741748302, 292970.0
[READ], 21200, 104.51397856732362, 295810.0
[READ], 21300, 102.32174747007078, 302380.0
[READ], 21400, 102.67923399162179, 300780.0
[READ], 21500, 105.20501309390198, 294030.0
[READ], 21600, 104.9682383648012, 295010.0
[READ], 21700, 104.8676300970215, 294780.0
[READ], 21800, 104.34017515977412, 295730.0
[READ], 21900, 104.43608083943452, 296390.0
[READ], 22000, 104.60843086554165, 293920.0
[READ], 22100, 104.52146907912504, 296240.0
[READ], 22200, 103.60839931843239, 299310.0
[READ], 22300, 102.45636429776117, 302390.0
[READ], 22400, 102.79245345634354, 301330.0
[READ], 22500, 103.9076448083764, 297980.0
[READ], 22600, 104.40784406459024, 296020.0
[READ], 22700, 104.88680586105377, 295510.0
[READ], 22800, 104.03871488103239, 297560.0
[READ], 22900, 104.65138110353212, 296140.0
[READ], 23000, 104.44789589318911, 295850.0
[READ], 23100, 103.8385018123238, 297960.0
[READ], 23200, 103.27197407543514, 299330.0
[READ], 23300, 102.67541995883407, 301220.0
[READ], 23400, 102.2041637797354, 303090.0
[READ], 23500, 103.57273730315289, 299090.0
[READ], 23600, 104.15682650626701, 297590.0
[READ], 23700, 103.77123241795043, 298600.0
[READ], 23800, 104.42096926395254, 296720.0
[READ], 23900, 105.1091873873261, 293990.0
[READ], 24000, 104.27312849538441, 296820.0
[READ], 24100, 103.74679605153086, 298850.0
[READ], 24200, 103.60834976769061, 299170.0
[READ], 24300, 101.8046303014313, 303220.0
[READ], 24400, 102.77686939182453, 300900.0
[READ], 24500, 103.21337420451138, 300130.0
[READ], 24600, 103.77459977225534, 298580.0
[READ], 24700, 104.14953773743487, 297450.0
[READ], 24800, 104.12289034866095, 296850.0
[READ], 24900, 104.40510345293144, 296270.0
[READ], 25000, 105.24584875547556, 294490.0
[READ], 25100, 104.21678699143108, 296420.0
[READ], 25200, 103.78010173348504, 298820.0
[READ], 25300, 101.64912223133716, 304750.0
[READ], 25400, 101.98972907133687, 303770.0
[READ], 25500, 103.8936640965471, 298300.0
[READ], 25600, 104.40350995385185, 296870.0
[READ], 25700, 105.04542365971325, 294340.0
[READ], 25800, 104.29754580488135, 295820.0
[READ], 25900, 104.94813150908719, 293820.0
[READ], 26000, 105.66504870962228, 292550.0
[READ], 26100, 104.0528190309791, 297620.0
[READ], 26200, 103.20130605717331, 300140.0
[READ], 26300, 102.08006589785832, 303500.0
[READ], 26400, 101.72992580920491, 304620.0
[READ], 26500, 103.65652987568507, 299240.0
[READ], 26600, 104.09880158890459, 297060.0
[READ], 26700, 104.05414130544439, 297370.0
[READ], 26800, 104.45287728529988, 296460.0
[READ], 26900, 104.56575305474921, 296260.0
[READ], 27000, 104.93923887627504, 295090.0
[READ], 27100, 104.29040837625828, 297030.0
[READ], 27200, 104.20162158525098, 297240.0
[READ], 27300, 102.91856482559106, 300730.0
[READ], 27400, 103.08195086272815, 300790.0
[READ], 27500, 104.49399662731872, 296500.0
[READ], 27600, 104.70911301763157, 296060.0
[READ], 27700, 105.89240917324584, 292590.0
[READ], 27800, 105.6125302684083, 293210.0
[READ], 27900, 107.3511246664125, 288530.0
[READ], 28000, 105.78360869267156, 291740.0
[READ], 28100, 104.04059958324932, 297540.0
[READ], 28200, 103.8840983001978, 298270.0
[READ], 28300, 101.61365725541694, 304600.0
[READ], 28400, 103.01606465775295, 300660.0
[READ], 28500, 104.20626386181867, 297580.0
[READ], 28600, 103.95639740268479, 297230.0
[READ], 28700, 104.25629360024264, 296730.0
[READ], 28800, 104.91725304465494, 295600.0
[READ], 28900, 105.9688696008748, 292640.0
[READ], 29000, 105.14616792030901, 295140.0
[READ], 29100, 104.12029746281715, 297180.0
[READ], 29200, 104.33407370015144, 297150.0
[READ], 29300, 102.20106743979179, 303530.0
[READ], 29400, 102.05766062602966, 303500.0
[READ], 29500, 103.20876340147832, 300340.0
[READ], 29600, 103.6449073919014, 298570.0
[READ], 29700, 104.97831913955146, 294730.0
[READ], 29800, 104.30981316276721, 297050.0
 30 sec: 8802192 operations; 297245.5 current ops/sec; [READ AverageLatency(us)=104.22] 
 30 sec: 8802192 operations; 297245.5 current ops/sec; [READ AverageLatency(us)=107.72] 
 32 sec: 9399738 operations; 298623.69 current ops/sec; [READ AverageLatency(us)=103.64] 
 32 sec: 9399738 operations; 298623.69 current ops/sec; [READ AverageLatency(us)=114.24] 
 34 sec: 10002572 operations; 301417 current ops/sec; [READ AverageLatency(us)=102.84] 
 34 sec: 10002572 operations; 301417 current ops/sec; [READ AverageLatency(us)=95.6] 
 36 sec: 10607541 operations; 302333.33 current ops/sec; [READ AverageLatency(us)=102.45] 
 36 sec: 10607541 operations; 302333.33 current ops/sec; [READ AverageLatency(us)=96.78] 
 38 sec: 11213190 operations; 302824.5 current ops/sec; [READ AverageLatency(us)=102.36] 
 38 sec: 11213190 operations; 302824.5 current ops/sec; [READ AverageLatency(us)=103.22] 
 40 sec: 11816085 operations; 301296.85 current ops/sec; [READ AverageLatency(us)=102.81] 
 40 sec: 11816085 operations; 301296.85 current ops/sec; [READ AverageLatency(us)=97.77] 
 42 sec: 12421002 operations; 302458.5 current ops/sec; [READ AverageLatency(us)=102.47] 
 42 sec: 12421002 operations; 302458.5 current ops/sec; [READ AverageLatency(us)=102.6] 
 44 sec: 13018900 operations; 298949 current ops/sec; [READ AverageLatency(us)=103.52] 
 44 sec: 13018900 operations; 298949 current ops/sec; [READ AverageLatency(us)=103.12] 
 46 sec: 13613659 operations; 297230.88 current ops/sec; [READ AverageLatency(us)=104.1] 
 46 sec: 13613659 operations; 297230.88 current ops/sec; [READ AverageLatency(us)=100.36] 
 48 sec: 14206471 operations; 296406 current ops/sec; [READ AverageLatency(us)=104.44] 
 48 sec: 14206471 operations; 296406 current ops/sec; [READ AverageLatency(us)=136.28] 
 50 sec: 14800602 operations; 296917.04 current ops/sec; [READ AverageLatency(us)=104.2] 
 50 sec: 14800602 operations; 296917.04 current ops/sec; [READ AverageLatency(us)=110.46] 
 52 sec: 15392678 operations; 296038 current ops/sec; [READ AverageLatency(us)=104.59] 
 52 sec: 15392678 operations; 296038 current ops/sec; [READ AverageLatency(us)=104.61] 
 54 sec: 15984376 operations; 295849 current ops/sec; [READ AverageLatency(us)=104.62] 
 54 sec: 15984376 operations; 295849 current ops/sec; [READ AverageLatency(us)=103.44] 
 56 sec: 16576866 operations; 296096.95 current ops/sec; [READ AverageLatency(us)=104.53] 
 56 sec: 16576866 operations; 296096.95 current ops/sec; [READ AverageLatency(us)=108.6] 
 58 sec: 17168495 operations; 295814.5 current ops/sec; [READ AverageLatency(us)=104.63] 
 58 sec: 17168495 operations; 295814.5 current ops/sec; [READ AverageLatency(us)=113.23] 
[READ], 29900, 108.15243774848295, 286740.0
[READ], 30000, 105.25367459859466, 294590.0
[READ], 30100, 105.07175588065579, 294610.0
[READ], 30200, 103.72676772747047, 298830.0
[READ], 30300, 101.66353728991596, 304640.0
[READ], 30400, 102.32253479223827, 302510.0
[READ], 30500, 103.35256174593096, 299210.0
[READ], 30600, 103.84945947760693, 297860.0
[READ], 30700, 103.652312119387, 298860.0
[READ], 30800, 104.08641684607105, 297280.0
[READ], 30900, 104.36561931090284, 296620.0
[READ], 31000, 104.161847767617, 297440.0
[READ], 31100, 104.30085901970692, 296850.0
[READ], 31200, 103.84625201504568, 297760.0
[READ], 31300, 102.25498862099674, 303190.0
[READ], 31400, 101.66276739066146, 304330.0
[READ], 31500, 102.45398162581672, 301510.0
[READ], 31600, 103.28801681850035, 299670.0
[READ], 31700, 104.81697908912498, 295540.0
[READ], 31800, 104.19578961528114, 297360.0
[READ], 31900, 104.2962451591177, 296950.0
[READ], 32000, 106.24732253192366, 291320.0
[READ], 32100, 104.63827343961091, 296080.0
[READ], 32200, 104.00869244193852, 297960.0
[READ], 32300, 101.34288047028086, 306200.0
[READ], 32400, 101.54855548260014, 304600.0
[READ], 32500, 103.4383360576442, 299770.0
[READ], 32600, 103.7096071332797, 298320.0
[READ], 32700, 102.56761583490426, 302370.0
[READ], 32800, 103.69639633616367, 299140.0
[READ], 32900, 102.85231452334405, 301790.0
[READ], 33000, 103.32496085812319, 300190.0
[READ], 33100, 102.67094681801635, 302170.0
[READ], 33200, 103.35840117442947, 299720.0
[READ], 33300, 100.66681855166803, 307250.0
[READ], 33400, 100.75223453700393, 307670.0
[READ], 33500, 101.67515986227251, 304950.0
[READ], 33600, 101.75242287854397, 304390.0
[READ], 33700, 102.44000528733353, 302610.0
[READ], 33800, 102.57192448837901, 302470.0
[READ], 33900, 103.75447818662738, 298670.0
[READ], 34000, 103.42515110027716, 299470.0
[READ], 34100, 103.12059097564222, 300520.0
[READ], 34200, 102.98001593413889, 301240.0
[READ], 34300, 100.86551152433276, 307610.0
[READ], 34400, 100.90944689182575, 306450.0
[READ], 34500, 102.7759949713832, 302270.0
[READ], 34600, 101.3004884124955, 305070.0
[READ], 34700, 102.15810289706997, 303410.0
[READ], 34800, 103.4741940871889, 299350.0
[READ], 34900, 102.88845771144278, 301500.0
[READ], 35000, 103.76067690043811, 299010.0
[READ], 35100, 102.86724751421636, 300710.0
[READ], 35200, 103.61785379568884, 298760.0
[READ], 35300, 101.56644937268648, 305270.0
[READ], 35400, 100.99033014260598, 307140.0
[READ], 35500, 101.80144059992107, 304040.0
[READ], 35600, 101.43525638927976, 305590.0
[READ], 35700, 102.25481261350504, 302850.0
[READ], 35800, 103.66387539775582, 298550.0
[READ], 35900, 103.36415277174459, 299270.0
[READ], 36000, 103.61856946815276, 298770.0
[READ], 36100, 103.1854390576648, 300530.0
[READ], 36200, 102.26848184818482, 303000.0
[READ], 36300, 101.03593790764414, 306640.0
[READ], 36400, 101.62655492994631, 305480.0
[READ], 36500, 101.17010023180646, 306290.0
[READ], 36600, 101.38772641077617, 305860.0
[READ], 36700, 102.60320873304664, 302300.0
[READ], 36800, 103.05638584695271, 300430.0
[READ], 36900, 103.44044673309703, 299060.0
[READ], 37000, 102.78586645363158, 300420.0
[READ], 37100, 102.73627831393227, 301530.0
[READ], 37200, 103.19070123473226, 300470.0
[READ], 37300, 101.36109023170692, 305990.0
[READ], 37400, 101.01726440600672, 306990.0
[READ], 37500, 101.6515718317254, 304740.0
[READ], 37600, 101.88794293603313, 304220.0
[READ], 37700, 102.26315963935296, 301680.0
[READ], 37800, 103.96592122830441, 299600.0
[READ], 37900, 103.37884801387453, 299830.0
[READ], 38000, 108.93645778479902, 284850.0
[READ], 38100, 102.79687862420889, 301790.0
[READ], 38200, 102.2662311955661, 303120.0
[READ], 38300, 101.76054529289736, 303690.0
[READ], 38400, 100.9920877832769, 307120.0
[READ], 38500, 101.04417105650623, 305630.0
[READ], 38600, 102.10392944119002, 303860.0
[READ], 38700, 102.27371756783522, 302940.0
[READ], 38800, 103.50966707850536, 299470.0
[READ], 38900, 104.20035657819491, 297270.0
[READ], 39000, 103.02098088113051, 300750.0
[READ], 39100, 106.55727628596937, 291220.0
[READ], 39200, 102.39342040006612, 302450.0
[READ], 39300, 101.79096769949345, 304020.0
[READ], 39400, 100.87733515589403, 307260.0
[READ], 39500, 101.21254332613955, 305820.0
[READ], 39600, 101.83978919631093, 303600.0
[READ], 39700, 102.03489941724558, 303730.0
[READ], 39800, 103.59862538369144, 299720.0
[READ], 39900, 103.18169421625038, 300670.0
[READ], 40000, 104.23667585187177, 297580.0
[READ], 40100, 102.99058079547346, 300450.0
[READ], 40200, 102.77491203611498, 301260.0
[READ], 40300, 101.98114076950927, 303830.0
[READ], 40400, 100.78373364577232, 307260.0
[READ], 40500, 101.96269123211054, 303950.0
[READ], 40600, 101.44806771209238, 304820.0
[READ], 40700, 102.98533568317094, 300730.0
[READ], 40800, 102.6373964889036, 301900.0
[READ], 40900, 103.28159770804184, 300180.0
[READ], 41000, 104.01376023627333, 297960.0
[READ], 41100, 102.8844097625768, 301150.0
[READ], 41200, 103.28249058364722, 300010.0
[READ], 41300, 101.39728314238953, 305500.0
[READ], 41400, 101.42801569140242, 305900.0
[READ], 41500, 101.14639397201292, 306570.0
[READ], 41600, 101.64371286966225, 304670.0
[READ], 41700, 102.11907662923568, 303670.0
[READ], 41800, 103.37089186213339, 299710.0
[READ], 41900, 103.20222813435318, 300700.0
[READ], 42000, 105.19040184632094, 294640.0
[READ], 42100, 103.1992343541944, 300400.0
[READ], 42200, 103.41924272298901, 299230.0
[READ], 42300, 101.7403505317054, 304680.0
[READ], 42400, 101.47044932764841, 304900.0
[READ], 42500, 100.80466025745478, 306850.0
[READ], 42600, 102.31647742276208, 302960.0
[READ], 42700, 103.55516860328835, 298630.0
[READ], 42800, 105.11304170073589, 293520.0
[READ], 42900, 103.95208172317618, 297590.0
[READ], 43000, 104.78158611300204, 293800.0
[READ], 43100, 105.4627967081548, 294060.0
[READ], 43200, 104.6545731191885, 295750.0
[READ], 43300, 102.99274228451577, 300370.0
[READ], 43400, 101.95996573198458, 303490.0
[READ], 43500, 102.72731794667727, 301560.0
[READ], 43600, 104.1450635978195, 297180.0
[READ], 43700, 104.39338136277942, 297040.0
[READ], 43800, 105.14265719942651, 292940.0
[READ], 43900, 104.02671511725715, 297210.0
[READ], 44000, 105.54919486899563, 293120.0
[READ], 44100, 104.49491708602115, 296090.0
[READ], 44200, 104.72539000372238, 295510.0
[READ], 44300, 103.12391152036834, 299730.0
[READ], 44400, 101.9992095903043, 303640.0
[READ], 44500, 102.74782666401221, 301380.0
[READ], 44600, 103.98700426475033, 297790.0
[READ], 44700, 104.7829751226942, 295450.0
[READ], 44800, 104.92147218453188, 294800.0
[READ], 44900, 105.18253075690966, 293430.0
[READ], 45000, 104.61809893634982, 296150.0
[READ], 45100, 104.87529212531753, 295250.0
[READ], 45200, 103.80421222080622, 298180.0
[READ], 45300, 103.56783314950366, 299190.0
[READ], 45400, 101.83061311615383, 304510.0
[READ], 45500, 102.19940328194927, 301650.0
[READ], 45600, 105.69926199261992, 292680.0
[READ], 45700, 104.30913743182278, 297020.0
[READ], 45800, 105.19961951352086, 294360.0
[READ], 45900, 105.3262021189894, 294480.0
[READ], 46000, 105.15287208039109, 294560.0
[READ], 46100, 105.33151785410355, 293770.0
[READ], 46200, 104.28742132013868, 297090.0
[READ], 46300, 103.71542205067965, 297950.0
[READ], 46400, 102.4635687117579, 302350.0
[READ], 46500, 102.4050900677574, 302550.0
[READ], 46600, 104.54920527561718, 295700.0
[READ], 46700, 104.07219125646364, 297820.0
[READ], 46800, 106.8248765154917, 289510.0
[READ], 46900, 105.44574410039559, 293240.0
[READ], 47000, 104.98853663514525, 293980.0
[READ], 47100, 105.65762503416234, 292720.0
[READ], 47200, 105.09602772775153, 294290.0
[READ], 47300, 103.65954101431821, 298920.0
[READ], 47400, 102.21252522579151, 302270.0
[READ], 47500, 103.15716856628674, 300060.0
[READ], 47600, 103.74752657879733, 298170.0
[READ], 47700, 104.68931480918094, 295830.0
[READ], 47800, 105.10423165604232, 294920.0
[READ], 47900, 105.87089394249813, 292860.0
[READ], 48000, 105.92699682149082, 292590.0
[READ], 48100, 104.89166525207945, 294550.0
[READ], 48200, 104.6180374936666, 296050.0
[READ], 48300, 103.83065463208402, 298030.0
[READ], 48400, 102.69064604970634, 301370.0
[READ], 48500, 103.22061518978904, 300070.0
[READ], 48600, 103.59492865277684, 298540.0
[READ], 48700, 104.35292132176731, 296270.0
[READ], 48800, 104.59560662385941, 295900.0
[READ], 48900, 104.8488301325399, 295760.0
[READ], 49000, 104.13822915965821, 297260.0
[READ], 49100, 104.65206045818083, 295080.0
[READ], 49200, 104.6329912914332, 296260.0
[READ], 49300, 103.49630674187483, 297840.0
[READ], 49400, 102.21430693559569, 302930.0
[READ], 49500, 103.21434512126152, 300590.0
[READ], 49600, 104.4882473948673, 296530.0
[READ], 49700, 104.59441668917094, 296240.0
[READ], 49800, 104.81019820430289, 295150.0
[READ], 49900, 105.21400142871721, 293970.0
[READ], 50000, 105.54703130868243, 292890.0
[READ], 50100, 105.52218929872961, 293610.0
[READ], 50200, 104.15684954560754, 297100.0
[READ], 50300, 104.41235375434101, 296590.0
[READ], 50400, 101.87873109796186, 304200.0
[READ], 50500, 103.22784092803093, 299990.0
[READ], 50600, 104.40477153255155, 296760.0
[READ], 50700, 105.27806139813491, 293820.0
[READ], 50800, 104.57216216216216, 296000.0
[READ], 50900, 105.47492424500358, 293710.0
[READ], 51000, 105.96452366233945, 291180.0
[READ], 51100, 105.15181910914654, 294100.0
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
[READ], 51200, 105.10464011939489, 294820.0
[READ], 51300, 105.0060682080141, 294980.0
[READ], 51400, 102.12104117181315, 303120.0
[READ], 51500, 103.91603694374476, 297750.0
[READ], 51600, 104.41765578635015, 296560.0
[READ], 51700, 105.62679393216294, 293350.0
[READ], 51800, 105.23313822908868, 293860.0
[READ], 51900, 105.14098260604212, 294930.0
[READ], 52000, 105.58207682336085, 293140.0
[READ], 52100, 105.77522951435104, 293010.0
[READ], 52200, 104.95987936701569, 295110.0
[READ], 52300, 104.38810657481511, 296130.0
[READ], 52400, 103.39126509045916, 299030.0
[READ], 52500, 103.06378374779453, 300390.0
[READ], 52600, 106.97437402866517, 289550.0
[READ], 52700, 104.92071186440678, 295000.0
[READ], 52800, 104.9367556746853, 294730.0
[READ], 52900, 105.0026793284721, 294850.0
[READ], 53000, 105.48197460057354, 292920.0
[READ], 53100, 104.76452858303983, 295280.0
[READ], 53200, 104.57964452253836, 295940.0
[READ], 53300, 103.97384501745904, 297840.0
[READ], 53400, 102.20402232422971, 302810.0
[READ], 53500, 103.08154849008913, 300680.0
[READ], 53600, 104.17460477972158, 296670.0
[READ], 53700, 105.36316291102186, 293780.0
[READ], 53800, 104.82712450425409, 295010.0
[READ], 53900, 105.1574669251437, 294030.0
[READ], 54000, 105.76403532794743, 292120.0
[READ], 54100, 105.16985101978484, 294670.0
[READ], 54200, 104.47670129606443, 295510.0
[READ], 54300, 104.93254076086957, 294400.0
[READ], 54400, 102.62779822903194, 301530.0
[READ], 54500, 103.06509819559366, 300930.0
[READ], 54600, 104.25176494318563, 297460.0
[READ], 54700, 104.35192424344544, 296740.0
[READ], 54800, 105.04438792811122, 294900.0
[READ], 54900, 105.35195035460993, 293280.0
[READ], 55000, 105.49851621925845, 293170.0
[READ], 55100, 106.28502398903359, 291800.0
[READ], 55200, 104.50576923076923, 296400.0
[READ], 55300, 104.91720911310009, 294960.0
[READ], 55400, 102.5310299223012, 302450.0
[READ], 55500, 102.71172336051985, 301620.0
[READ], 55600, 104.68605162556243, 295590.0
[READ], 55700, 104.55994734354958, 296260.0
[READ], 55800, 105.30182781816946, 294340.0
[READ], 55900, 105.38983454755906, 293740.0
[READ], 56000, 107.3718095634962, 287970.0
[READ], 56100, 105.16337003806416, 294240.0
[READ], 56200, 104.50612894487335, 295320.0
[READ], 56300, 104.20017494280717, 297240.0
[READ], 56400, 102.65161076054467, 301100.0
[READ], 56500, 103.82429522976518, 297260.0
[READ], 56600, 104.44825493171471, 296550.0
[READ], 56700, 104.89928203738825, 295280.0
[READ], 56800, 104.5403917595407, 296100.0
[READ], 56900, 104.85304975107529, 295270.0
[READ], 57000, 105.34572351640877, 294050.0
[READ], 57100, 105.1706537991029, 294280.0
[READ], 57200, 104.77350369416389, 295060.0
[READ], 57300, 105.2285704574808, 294220.0
[READ], 57400, 103.33658145898686, 299660.0
[READ], 57500, 103.43949683851326, 298910.0
[READ], 57600, 104.43211875843454, 296400.0
[READ], 57700, 104.89956671857017, 295420.0
[READ], 57800, 104.23693414945853, 297340.0
[READ], 57900, 104.76353729524841, 295480.0
[READ], 58000, 106.48241932154407, 290660.0
[READ], 58100, 105.98194525334887, 291890.0
[READ], 58200, 104.80648879547073, 294970.0
[READ], 58300, 109.3621474709682, 283310.0
[READ], 58400, 103.13317328531893, 299910.0
[READ], 58500, 102.92283417486048, 301040.0
[READ], 58600, 104.84270233660683, 295300.0
[READ], 58700, 104.82344986138347, 295780.0
[READ], 58800, 104.87854937748075, 294770.0
[READ], 58900, 105.36846574504942, 294410.0
[READ], 59000, 104.86349464551986, 295080.0
[READ], 59100, 104.93265230186381, 295630.0
[READ], 59200, 105.07805241921812, 294930.0
[READ], 59300, 104.1615954224167, 297100.0
[READ], 59400, 103.03407239969418, 300830.0
[READ], 59500, 102.6233774834437, 302000.0
[READ], 59600, 106.03627350427351, 292500.0
[READ], 59700, 104.89519338708031, 293970.0
[READ], 59800, 106.30851136441198, 293020.0
 60 sec: 17751983 operations; 293800.6 current ops/sec; [READ AverageLatency(us)=105.11] [CLEANUP AverageLatency(us)=1544.91] 
 60 sec: 17751983 operations; 293800.6 current ops/sec;   
[READ], 59900, 109.48891843971631, 203040.0
[READ], Operations, 17751983
[READ], Retries, 0
[READ], AverageLatency(us), 104.32092386523804
[READ], MinLatency(us), 17
[READ], MaxLatency(us), 19836
[READ], Return=0, 17748232
[CLEANUP], 0, 1544.90625, 320.0
[CLEANUP], Operations, 32
[CLEANUP], Retries, 0
[CLEANUP], AverageLatency(us), 1544.90625
[CLEANUP], MinLatency(us), 123
[CLEANUP], MaxLatency(us), 6687
[OVERALL], Reconnections, 0.0
[OVERALL], RunTime(ms), 59994.0
[OVERALL], Operations, 1.7751983E7
[OVERALL], Throughput(ops/sec), 295895.9729306264
java -cp /opt/ycsb/aerospike-binding/lib/aerospike-binding-0.1.4.jar:/opt/ycsb/core/lib/core-0.1.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.AerospikeClient -s -P /opt/ycsb/workloads/workloadc -p workload=com.yahoo.ycsb.workloads.CoreWorkload -p updateretrycount=1000 -p ns=test -p recordcount=50000000 -p exportmeasurementsinterval=30000 -p fieldcount=10 -p timeseries.granularity=100 -p host=f1 -p threadcount=32 -p insertretrycount=10 -p readretrycount=1000 -p ignoreinserterrors=true -p reconnectionthroughput=10 -p operationcount=60000000 -p fieldnameprefix=f -p maxexecutiontime=60 -p set=YCSB -p measurementtype=timeseries -p reconnectiontime=1000 -p port=3000 -p fieldlength=10 -t